app/Controllers/Auth/Login.php

        //SET SESI SELESAI
        //MASUKKAN DATA KE TABEL USER,UNTUK MENANDAI JIKA BERHASIL LOGIN
        $LoginLogModel = new LoginLogModel();
        $LoginLogModel->save([
            'user_id'    => $user['id'],
            'ip_address' => $this->request->getIPAddress(),
            'user_agent' => $this->request->getUserAgent()->getAgentString(),
            'is_success' => true,
            'credential_used' => $email,
        ]);
---
INSERT INTO "auth"."login_logs" ("user_id", "ip_address", "user_agent", "is_success", "credential_used") VALUES ('2', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36 Edg/139.0.0.0', TRUE, 'admin@kominfogunungkidul.com')