app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $currentMonth = date('m');
        $currentYear = date('Y');
        $startDate = date("Y-m-01");
        $endDate = date("Y-m-t 23:59:59");

        $data = [
            'title' => 'Dashboard Admin',
            'totalTamu' => $this->tamuModel->countAll(),
            'tamuHariIni' => $this->tamuModel->where('DATE(created_at)', date('Y-m-d'))->countAllResults(),
            'tamuBulanIni' => $this->tamuModel->where('created_at >=', $startDate)
                                              ->where('created_at <=', $endDate)
                                              ->countAllResults(),
            'tamuPerempuan' => $this->tamuModel->where('jenis_kelamin', 'Perempuan')->countAllResults(),
            'tamu' => $this->tamuModel->orderBy('jam_datang', 'DESC')->findAll(10),
---
SELECT COUNT(*) AS "numrows" FROM "adminDashboard"."tamu"
SELECT COUNT(*) AS "numrows"
FROM "adminDashboard"."tamu"
WHERE DATE(created_at) = '2025-08-11'
SELECT COUNT(*) AS "numrows"
FROM "adminDashboard"."tamu"
WHERE "created_at" >= '2025-08-01'
AND "created_at" <= '2025-08-31 23:59:59'
SELECT COUNT(*) AS "numrows"
FROM "adminDashboard"."tamu"
WHERE "jenis_kelamin" = 'Perempuan'
SELECT *
FROM "adminDashboard"."tamu"
ORDER BY "jam_datang" DESC
 LIMIT 10

    public function detail($id)
    {
        $tamu = $this->tamuModel->find($id);
---
SELECT *
FROM "adminDashboard"."tamu"
WHERE "adminDashboard"."tamu"."id" = '21'

    public function print($id)
    {
        $tamu = $this->tamuModel->find($id);
---
SELECT *
FROM "adminDashboard"."tamu"
WHERE "adminDashboard"."tamu"."id" = '21'